---
kind: type
id: T:Autodesk.Revit.DB.Macros.MacroModule
source: html/d604a3cb-4f41-78a8-6353-270c566ac661.htm
---
# Autodesk.Revit.DB.Macros.MacroModule

A container for individual macros. As it relates to the macros editor, one MacroModule represents
 a project that can be loaded and edited from within the editor.

## Syntax (C#)
```csharp
public class MacroModule : IEnumerable<Macro>,
	IDisposable
```